app/controllers/songs_controller.rb

SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "songs".* FROM "songs"
---
  def index
    if params[:artist_id]
      @songs = Song.find_by(id: params[:artist_id])
      if @artist
        @songs = @artist.songs
      else
        flash[:alert] = "Artist not found."
        redirect_to artist_path
      end
    else
      @songs = Song.all

SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 2]]
---
  def show
    if params[:artist_id]
      @song = Song.find_by(id: params[:id])
      @artist = Artist.find_by(id: params[:artist_id])